src/mathematics/linear_algebra/KBe21math530retAxler6B9.org
#+TITLE: Axler6.B #9
#+AUTHOR: Exr0n
* Problem
#+begin_quote
What happens if the Gram–Schmidt Procedure is applied to a list of vectors that is not linearly independent?
#+end_quote
* Answer
  Suppose the list $v_1, \ldots, v_n$ is linearly dependent. Then, there exists some $v_j$ s.t. $v_1, \ldots, v_{j-1}$ is linearly independent while $v_1, \ldots, v_j$ is not. Then, $v_j \in \text{span}(v_1, \ldots, v_{j-1})$

  Because the Gram-Schmidt procedure preserves prefix spans,
\[ v_j \in \text{span}(e_1, \ldots, e_{j-1}) \]

  Because of how a vector is written as a linear combination of an orthonormal basis, the denominator in the $j$-th step of the procedure is equivalent to
  \[
  \lVert v - v \rVert = \lVert 0 \rVert = 0
  \]
  and a division by zero occurs. Thus, the Gram-Schmidt procedure cannot be used on a linearly dependent list.
